using System;
using System.Collections.Generic;
using System.Text;

namespace CLDC_Comm.Enum
{
    /// <summary>
    /// 总方案项目
    /// </summary>
    public enum Cus_FAGroup
    {
        /// <summary>
        /// 
        /// </summary>
        Error = 0,

        /// <summary>
        /// 
        /// </summary>
        预热试验 = 1,

        /// <summary>
        /// 
        /// </summary>
        预先调试 = 2,

        /// <summary>
        /// 
        /// </summary>
        外观检查试验 = 3,

        /// <summary>
        /// 
        /// </summary>
        工频耐压试验 = 4,

        /// <summary>
        /// 
        /// </summary>
        起动试验 = 5,

        /// <summary>
        /// 
        /// </summary>
        潜动试验 = 6,

        /// <summary>
        /// 
        /// </summary>
        基本误差试验 = 7,

        /// <summary>
        /// 
        /// </summary>
        走字试验 = 8,

        /// <summary>
        /// 
        /// </summary>
        通讯协议检查试验 = 9,

        /// <summary>
        /// 
        /// </summary>
        多功能试验 = 10,

        /// <summary>
        /// 
        /// </summary>
        影响量试验 = 11,

        /// <summary>
        /// 
        /// </summary>
        载波试验 = 12,

        /// <summary>
        /// 
        /// </summary>
        误差一致性 = 13,

        /// <summary>
        /// 
        /// </summary>
        功耗试验 = 14,

        /// <summary>
        /// 
        /// </summary>
        费控功能试验 = 15,

        /// <summary>
        /// 
        /// </summary>
        智能表功能试验 = 16,

        /// <summary>
        /// 
        /// </summary>
        事件记录试验 = 17,

        /// <summary>
        /// 
        /// </summary>
        冻结功能试验 = 18,

        /// <summary>
        /// 
        /// </summary>
        数据转发试验 = 19,
        
		
		/// <summary>
        /// 
        /// </summary>
        红外数据比对试验=20,

        /// <summary>
        /// 
        /// </summary>
        负荷记录试验 = 21,


        //外观_标志_通电检查 = 1,
        //电流变化引起的百分误差 = 2,
        //电能表常数试验 = 3,
        //起动试验 = 4,
        //潜动试验 = 5,
        //环境温度影响 = 6,
        //影响量试验 = 7,
        //计度器总电能示值误差 = 8,
        //费率时段电能示值误差 = 9,
        //需量示值误差 = 10,
        //日计时误差 = 11,
        //环境温度对日计时误差的影响 = 12,
        //时段投切误差 = 13,
        //需量周期误差 = 14,
        //测量重复性试验 = 15,
        //误差变差试验 = 16,
        //误差一致性试验 = 17,
        //负载电流升降变差试验 = 18,
        //功率消耗 = 19,
        //电源电压影响试验 = 20,
        //短时过电流影响试验 = 21,
        //自热试验 = 22,
        //温升试验 = 23,
        //抗接地故障抑制试验_仅对三相四线互感器接入式表 = 24,
        //电流回路阻抗测试 = 25,
        //通信模块接口带载能力测试 = 26,
        //通信模块互换能力试验 = 27,
        //脉冲电压试验 = 28,
        //交流电压试验 = 29,
        //静电放电抗扰度试验 = 30,
        //射频电磁场抗扰度试验 = 31,
        //快速瞬变脉冲群抗扰度试验 = 32,
        //浪涌抗扰度试验 = 33,
        //射频场感应的传导骚扰抗扰度 = 34,
        //衰减振荡波抗扰度 = 35,
        //无线电干扰抑制 = 36,
        //高温试验 = 37,
        //低温试验 = 38,
        //交变湿热试验 = 39,
        //阳光辐射防护试验 = 40,
        //防尘试验 = 41,
        //防水试验 = 42,
        //弹簧锤试验 = 43,
        //冲击试验 = 44,
        //振动试验 = 45,
        //耐热和阻燃试验 = 46,
        //费控功能试验 = 47,
        //密钥更新试验 = 48,
        //参数更新试验 = 49,
        //远程控制试验 = 50,
        //安全认证试验 = 51,
        //通信规约一致性检查 = 52,
        //功能测试 = 53,
        //样品比对 = 54

    }
}
